openFoam/dlrInflowVelocityProfileCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 19.58);

boundaryField
{
    combustorInlet
    {
        type            timeVaryingMappedFixedValue;
        offset          (0 0 0);
        setAverage      off;
    }

    combustorOutlet
    {
	type 		pressureInletOutletVelocity;
	value 		uniform (0 0 0);
    }

    combustorWall
    {
        type            noSlip;
    }

    combustorFrontWall
    {
        type            noSlip;
    }

    combustorExitWall
    {
        type            noSlip;
    }

    constrictionChannel
    {
        type            noSlip;
    }
}

// ************************************************************************* //
