openFoam/dlrInflowVelocityProfileCase/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    combustorInlet
    {
        type            calculated;
        value           uniform 0;
    }

    combustorOutlet
    {
        type            calculated;
        value           uniform 0;
    }

    combustorWall
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
        Prt             0.9;
    }

    combustorFrontWall
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
        Prt             0.9;
    }

    combustorExitWall
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
        Prt             0.9;
    }

    constrictionChannel
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
        Prt             0.9;
    }
}


// ************************************************************************* //
